Revit 2027 API
PerformanceAdviser.IsRuleEnabled(PerformanceAdviserRuleId) Method
 Retrieves an enabled/disabled status for the given rule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsRuleEnabled(
	PerformanceAdviserRuleId id
)
Public Function IsRuleEnabled (
	id As PerformanceAdviserRuleId
) As Boolean
public:
bool IsRuleEnabled(
	PerformanceAdviserRuleId^ id
)
member IsRuleEnabled :
        id : PerformanceAdviserRuleId -> bool
Parameters
id PerformanceAdviserRuleId
 The rule id to retrieve enabled/disabled status for.
Return Value
Boolean
 True if rule is disabled, false otherwise.
Exceptions
Exception | Condition
ArgumentException |  The id does not correspond to any registered rule.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PerformanceAdviser Class
IsRuleEnabled Overload
Autodesk.Revit.DB Namespace